# IsGrossBuildingArea Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AreaScheme..::..IsGrossBuildingArea Property
AreaScheme Class See Also
---
Indicates if the area scheme is a Gross Building Area scheme.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsGrossBuildingArea { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsGrossBuildingArea As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsGrossBuildingArea {
	bool get ();
}
```

# See Also
AreaScheme Class
Autodesk.Revit.DB Namespace